# Assign Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudOverrides..::..Assign Method
PointCloudOverrides Class See Also
---
Assigns values of the source overrides to this object.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Assign(
	PointCloudOverrides other
)
```

Visual Basic
---
```text
Public Sub Assign ( _
	other As PointCloudOverrides _
)
```

Visual C++
---
```text
public:
void Assign(
	PointCloudOverrides^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.PointClouds..::..PointCloudOverrides The source overrides.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace